<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class NationalitiesAndFeesSeeder extends Seeder
{
    public function run(): void
    {
        $batches = [
            [
                'fees' => [
                    ['type' => 'دخول', 'duration' => 'شهر', 'times' => 'مرة واحدة', 'price' => 50],
                    ['type' => 'دخول', 'duration' => '3 أشهر', 'times' => 'مرتين', 'price' => 75],
                    ['type' => 'دخول', 'duration' => '6 أشهر', 'times' => 'متعددة', 'price' => 100],
                    ['type' => 'مرور', 'duration' => '15 يوم', 'times' => 'مرة واحدة', 'price' => 25],
                ],
                'countries' => [
                    'سوريا',
                    'سوريا',
                    'سوريا',
                    'سوريا',
                    'العراق',
                    'العراق',
                    'العراق',
                    'العراق',
                    'مصر',
                    'مصر',
                    'مصر',
                    'مصر',
                    'لبنان',
                    'لبنان',
                    'لبنان',
                    'لبنان'
                ],
            ],
            [
                'fees' => [
                    ['type' => 'دخول', 'duration' => 'شهر', 'times' => 'مرة واحدة', 'price' => 50],
                    ['type' => 'دخول', 'duration' => '3 أشهر', 'times' => 'مرتين', 'price' => 75],
                    ['type' => 'دخول', 'duration' => '6 أشهر', 'times' => 'متعددة', 'price' => 100],
                    ['type' => 'مرور', 'duration' => '15 يوم', 'times' => 'مرة واحدة', 'price' => 25],
                ],
                'countries' => [
                    'سوريا',
                    'سوريا',
                    'سوريا',
                    'سوريا',
                    'العراق',
                    'العراق',
                    'العراق',
                    'العراق',
                    'مصر',
                    'مصر',
                    'مصر',
                    'مصر',
                    'لبنان',
                    'لبنان',
                    'لبنان',
                    'لبنان'
                ],
            ],
            [
                'fees' => [
                    ['type' => 'دخول', 'duration' => 'شهر', 'times' => 'مرة واحدة', 'price' => 75],
                    ['type' => 'دخول', 'duration' => '3 أشهر', 'times' => 'مرتين', 'price' => 112.5],
                    ['type' => 'دخول', 'duration' => '6 أشهر', 'times' => 'متعددة', 'price' => 150],
                    ['type' => 'مرور', 'duration' => '15 يوم', 'times' => 'مرة واحدة', 'price' => 37.5],
                ],
                'countries' => [
                    'السودان',
                    'السودان',
                    'السودان',
                    'السودان',
                    'الجزائر',
                    'الجزائر',
                    'الجزائر',
                    'الجزائر',
                    'تونس',
                    'تونس',
                    'تونس',
                    'تونس',
                    'المغرب',
                    'المغرب',
                    'المغرب',
                    'المغرب'
                ],
            ],
            [
                'fees' => [
                    ['type' => 'دخول', 'duration' => 'شهر', 'times' => 'مرة واحدة', 'price' => 100],
                    ['type' => 'دخول', 'duration' => '3 أشهر', 'times' => 'مرتين', 'price' => 150],
                    ['type' => 'دخول', 'duration' => '6 أشهر', 'times' => 'متعددة', 'price' => 200],
                    ['type' => 'مرور', 'duration' => '15 يوم', 'times' => 'مرة واحدة', 'price' => 50],
                ],
                'countries' => [
                    'الإمارات',
                    'الإمارات',
                    'الإمارات',
                    'الإمارات',
                    'أوغندا',
                    'أوغندا',
                    'أوغندا',
                    'أوغندا',
                    'جيبوتي',
                    'جيبوتي',
                    'جيبوتي',
                    'جيبوتي',
                    'سيراليون',
                    'سيراليون',
                    'سيراليون',
                    'سيراليون',
                    'كندا',
                    'كندا',
                    'كندا',
                    'كندا'
                ],
            ],
            [
                'fees' => [
                    ['type' => 'دخول', 'duration' => 'شهر', 'times' => 'مرة واحدة', 'price' => 150],
                    ['type' => 'دخول', 'duration' => '3 أشهر', 'times' => 'مرتين', 'price' => 225],
                    ['type' => 'دخول', 'duration' => '6 أشهر', 'times' => 'متعددة', 'price' => 300],
                    ['type' => 'مرور', 'duration' => '15 يوم', 'times' => 'مرة واحدة', 'price' => 75],
                ],
                'countries' => [
                    'نيجريا',
                    'نيجريا',
                    'نيجريا',
                    'نيجريا',
                    'بريطانيا',
                    'بريطانيا',
                    'بريطانيا',
                    'بريطانيا',
                    'الأرجنتين',
                    'الأرجنتين',
                    'الأرجنتين',
                    'الأرجنتين',
                    'كينيا',
                    'كينيا',
                    'كينيا',
                    'كينيا',
                    'أزوبكستان',
                    'أزوبكستان',
                    'أزوبكستان',
                    'أزوبكستان',
                    'أستراليا',
                    'أستراليا',
                    'أستراليا',
                    'أستراليا',
                    'أفغانستان',
                    'أفغانستان',
                    'أفغانستان',
                    'أفغانستان',
                    'بوروندي',
                    'بوروندي',
                    'بوروندي',
                    'بوروندي',
                    'الدومنيكان',
                    'الدومنيكان',
                    'الدومنيكان',
                    'الدومنيكان',
                    'فيجي',
                    'فيجي',
                    'فيجي',
                    'فيجي',
                    'ساتومي',
                    'ساتومي',
                    'ساتومي',
                    'ساتومي',
                    'الكاميرون',
                    'الكاميرون',
                    'الكاميرون',
                    'الكاميرون',
                    'غينيا الاستوائية',
                    'غينيا الاستوائية',
                    'غينيا الاستوائية',
                    'غينيا الاستوائية',
                    'غانا',
                    'غانا',
                    'غانا',
                    'غانا',
                    'نيوزلندا',
                    'نيوزلندا',
                    'نيوزلندا',
                    'نيوزلندا'
                ],
            ]
        ];

        foreach ($batches as $batch) {
            $fees = $batch['fees'];
            $countries = $batch['countries'];

            for ($i = 0; $i < count($countries); $i += 4) {
                $name = $countries[$i];
                $nationality = Nationality::firstOrCreate(['name' => $name]);

                for ($j = 0; $j < 4; $j++) {
                    Fee::create([
                        'nationality_id' => $nationality->id,
                        'type' => $fees[$j]['type'],
                        'duration' => $fees[$j]['duration'],
                        'times' => $fees[$j]['times'],
                        'price' => $fees[$j]['price'],
                    ]);
                }
            }
        }
    }
}
